Revit 2027 API
ElementIdSetFilter Constructor
 Constructs a new instance of a filter wrapping a set of elements.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public ElementIdSetFilter(
	ICollection<ElementId> idsToInclude
)
Public Sub New (
	idsToInclude As ICollection(Of ElementId)
)
public:
ElementIdSetFilter(
	ICollection<ElementId^>^ idsToInclude
)
new :
        idsToInclude : ICollection<ElementId> -> ElementIdSetFilter
Parameters
idsToInclude ICollection<ElementId>
 The ids.
Exceptions
Exception | Condition
ArgumentException |  The input collection of ids was empty, or its contents were not valid for iteration.
ArgumentNullException |  A non-optional argument was null
See Also
Reference
ElementIdSetFilter Class
Autodesk.Revit.DB Namespace